zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKW31Z4/MKW31Z4.svd
        <register>
          <name>DCOC_TZA_STEP_1</name>
          <description>DCOC TZA DAC Step 1</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_1</name>
              <description>DCOC_TZA_STEP_RCP_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_1</name>
              <description>DCOC_TZA_STEP_GAIN_1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_2</name>
          <description>DCOC TZA DAC Step 2</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_2</name>
              <description>DCOC_TZA_STEP_RCP_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_2</name>
              <description>DCOC_TZA_STEP_GAIN_2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_3</name>
          <description>DCOC TZA DAC Step 3</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_3</name>
              <description>DCOC_TZA_STEP_RCP_3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_3</name>
              <description>DCOC_TZA_STEP_GAIN_3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_4</name>
          <description>DCOC TZA DAC Step 4</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_4</name>
              <description>DCOC_TZA_STEP_RCP_4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_4</name>
              <description>DCOC_TZA_STEP_GAIN_4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_5</name>
          <description>DCOC TZA DAC Step 5</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_5</name>
              <description>DCOC_TZA_STEP_RCP_5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_5</name>
              <description>DCOC_TZA_STEP_GAIN_5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_6</name>
          <description>DCOC TZA DAC Step 6</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_6</name>
              <description>DCOC_TZA_STEP_RCP_6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_6</name>
              <description>DCOC_TZA_STEP_GAIN_6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_7</name>
          <description>DCOC TZA DAC Step 7</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_7</name>
              <description>DCOC_TZA_STEP_RCP_7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_7</name>
              <description>DCOC_TZA_STEP_GAIN_7</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_8</name>
          <description>DCOC TZA DAC Step 5</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_8</name>
              <description>DCOC_TZA_STEP_RCP_8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_8</name>
              <description>DCOC_TZA_STEP_GAIN_8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_9</name>
          <description>DCOC TZA DAC Step 9</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_9</name>
              <description>DCOC_TZA_STEP_RCP_9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_9</name>
              <description>DCOC_TZA_STEP_GAIN_9</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_10</name>
          <description>DCOC TZA DAC Step 10</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_10</name>
              <description>DCOC_TZA_STEP_RCP_10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_10</name>
              <description>DCOC_TZA_STEP_GAIN_10</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_CAL_ALPHA</name>
          <description>DCOC Calibration Alpha</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_CAL_ALPHA_I</name>
              <description>DCOC Calibration I-channel ALPHA constant</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCOC_CAL_ALPHA_Q</name>
              <description>DCOC_CAL_ALPHA_Q</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_CAL_BETA_Q</name>
          <description>DCOC Calibration Beta Q</description>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_CAL_BETA_Q</name>
              <description>DCOC_CAL_BETA_Q</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_CAL_BETA_I</name>
          <description>DCOC Calibration Beta I</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_CAL_BETA_I</name>
              <description>DCOC_CAL_BETA_I</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_CAL_GAMMA</name>
          <description>DCOC Calibration Gamma</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_CAL_GAMMA_I</name>
              <description>DCOC_CAL_GAMMA_I</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCOC_CAL_GAMMA_Q</name>
              <description>DCOC_CAL_GAMMA_Q</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_CAL_IIR</name>
          <description>DCOC Calibration IIR</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_CAL_IIR1A_IDX</name>
              <description>DCOC Calibration IIR 1A Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1/1</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1/4</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>1/8</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>1/16</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCOC_CAL_IIR2A_IDX</name>
              <description>DCOC Calibration IIR 2A Index</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1/1</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1/4</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>1/8</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>1/16</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCOC_CAL_IIR3A_IDX</name>
              <description>DCOC Calibration IIR 3A Index</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>1/4</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>1/8</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>1/16</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>1/32</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_CAL1</name>
          <description>DCOC Calibration Result</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_CAL_RES_I</name>
              <description>DCOC Calibration Result - I Channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCOC_CAL_RES_Q</name>
              <description>DCOC Calibration Result - Q Channel</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_CAL2</name>
          <description>DCOC Calibration Result</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_CAL_RES_I</name>
              <description>DCOC Calibration Result - I Channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCOC_CAL_RES_Q</name>
              <description>DCOC Calibration Result - Q Channel</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_CAL3</name>
          <description>DCOC Calibration Result</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_CAL_RES_I</name>
              <description>DCOC Calibration Result - I Channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCOC_CAL_RES_Q</name>
              <description>DCOC Calibration Result - Q Channel</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCA_ED_LQI_CTRL_0</name>
          <description>RX_DIG CCA ED LQI Control Register 0</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LQI_CORR_THRESH</name>
              <description>LQI Correlation Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORR_CNTR_THRESH</name>
              <description>Correlation Count Threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LQI_CNTR</name>
              <description>LQI Counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNR_ADJ</name>
              <description>SNR calculation adjustment</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
