zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKW31Z4/MKW31Z4.svd
        <register>
          <name>TIMING51</name>
          <description>TSM_TIMING51</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6703FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_BIAS_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_BIAS_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_BIAS_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_BIAS_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING52</name>
          <description>TSM_TIMING52</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1504FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_FCAL_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_FCAL_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_FCAL_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_FCAL_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING53</name>
          <description>TSM_TIMING53</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6704FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_LF_PD_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_LF_PD_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_LF_PD_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_LF_PD_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING54</name>
          <description>TSM_TIMING54</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1504FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING55</name>
          <description>TSM_TIMING55</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x671EFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_ADC_BUF_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_ADC_BUF_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_ADC_BUF_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_ADC_BUF_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING56</name>
          <description>TSM_TIMING56</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x671EFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_DIG_BUF_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_DIG_BUF_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_DIG_BUF_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_DIG_BUF_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING57</name>
          <description>TSM_TIMING57</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1A03FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_RCCAL_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_RCCAL_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_RCCAL_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_RCCAL_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING58</name>
          <description>TSM_TIMING58</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF6A03</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_HPM_DAC_EN_TX_HI</name>
              <description>Assertion time setting for TX_HPM_DAC_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_HPM_DAC_EN_TX_LO</name>
              <description>De-assertion time setting for TX_HPM_DAC_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
